app/controllers/folders_controller.rb

  def index
    @folders = Folder.all
    @notes = Note.all
---
SELECT "folders".* FROM "folders"
SELECT "notes".* FROM "notes"

  def create
    @folder = Folder.new(folder_params)
    respond_to do |format|
      format.html
      format.json {
        @folder.save
---
INSERT INTO "folders" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Jokes"], ["created_at", 2017-01-19 00:02:41 UTC], ["updated_at", 2017-01-19 00:02:41 UTC]]