app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)
    respond_to do |format|
      format.html
      format.json {
        @note.save
---
INSERT INTO "notes" ("body", "folder_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "New Note!"], ["folder_id", 8], ["created_at", 2017-01-20 01:54:09 UTC], ["updated_at", 2017-01-20 01:54:09 UTC]]

  def update
    @note = Note.find(params[:id])
    @note.update(note_params)
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "notes" SET "body" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["body", "Shin Kicking"], ["updated_at", 2017-01-24 01:33:45 UTC], ["id", 22]]

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 24]]